def infect(matrix):
    rows, cols = len(matrix), len(matrix[0])

    # 将第一行第一列的0变为2，并进行传染
    matrix[0][0] = 2
    infected_cells = [(0, 0)]

    while infected_cells:
        current_row, current_col = infected_cells.pop(0)

        # 检查上下左右四个方向
        directions = [(0, 1), (0, -1), (1, 0), (-1, 0)]
        for dr, dc in directions:
            new_row, new_col = current_row + dr, current_col + dc

            # 检查新位置是否在矩阵范围内且为0，是则变为2并加入传染列表
            if 0 <= new_row < rows and 0 <= new_col < cols and matrix[new_row][new_col] == 0:
                matrix[new_row][new_col] = 2
                infected_cells.append((new_row, new_col))

    # 统计最终矩阵中2的个数
    count_2 = sum(row.count(2) for row in matrix)
    return count_2

# 输入矩阵
matrix = [
    list(map(int, "0000100010000001101010101001001100000011")),
    list(map(int, "0101111001111101110111100000101010011111")),
    list(map(int, "1000010000011101010110000000001011010100")),
    list(map(int, "0110101010110000000101100100000101001001")),
    list(map(int, "0000011010100000111111001101100010101001")),
    list(map(int, "0110000110000000110100000000010010100011")),
    list(map(int, "0100110010000110000000100010000101110000")),
    list(map(int, "0010011010100110001111001101100110100010")),
    list(map(int, "1111000111101000001110010001001011101101")),
    list(map(int, "0011110100011000000001101001101110100001")),
    list(map(int, "0000000101011000010011111001010011011100")),
    list(map(int, "0000100000011001000100101000111011101100")),
    list(map(int, "0010110000001000001010100011000010100011")),
    list(map(int, "0110110000100011011010011010001101011011")),
    list(map(int, "0000100100000001010000101100000000000010")),
    list(map(int, "0011001000001000000010011001100101000110")),
    list(map(int, "1110101000011000000100011001001100111010")),
    list(map(int, "0000100100111000001101001000001010010001")),
    list(map(int, "0100010010000110100001100000110111110101")),
    list(map(int, "1000001001100010011001111101011001110001")),
    list(map(int, "0000000010100101000000111100110010101101")),
    list(map(int, "0010110101001100000100000010000010110011")),
    list(map(int, "0000011101001001000111011000100111010100")),
    list(map(int, "0010001100100000011000101011000000010101")),
    list(map(int, "1001111010010110011010101110000000101110")),
    list(map(int, "0110011101000010100001000101001001100010")),
    list(map(int, "1101000000010010011001000100110010000101")),
    list(map(int, "1001100010100010000100000101111111111100")),
    list(map(int, "1001011010101100001000000011000110110000")),
    list(map(int, "0011000100011000010111101000101110110001")),
]

# 计算结果
result = infect(matrix)
print(result)


s = input()
result = s[1:] + s[:1]
print(int(result))